import './index.css'

export default function UserName(){
    return <div>
         <Nav />
         <Main />
         <Footer/>
    </div>
}

function Nav(){
    return <div>
        <nav className="nav">
            <div id='logo'>
                <a href='#'></a>
            </div>
            <div id='menu'>
               <ul id='menu-content'>
                   <li><a href='#'>Գլխավոր</a></li>
                   <li><a href='#'>Քաղաքականություն</a></li>
                   <li><a href='#'>Տնտեսություն</a></li>
                   <li><a href='#'>Հասարակություն</a></li>
                   <li><a href='#'>Մշակույթ</a></li>
                   <li id='icon'>
                       <a href='#'></a>
                       <a href='#'></a>
                       <a href='#'></a>
                    </li>
               </ul>
             
            </div>
        </nav>
    </div>
}

function Main(){
    return <div className='main'>
         
         <div  className='main-content'>
              <div className='main-content-left'>
                  <div id='img'></div>
              </div>
              <div className='main-content-right'>
                  <ul className='list'>
                      <li><a href='#'>Կենսագրություն</a></li>
                      <li><a href='#'>Միսաք Մեծարենցի մասին</a></li>
                      <li><a href='#'>Ստեղծագործական աշխատանք</a></li>
                      <li><a href='#'>Մեծարենցի բանարվեստը</a></li>
                      <li className='list-v'><a href='#'>Գրականություն</a></li>
                  </ul>
                  <h2>Միսաք Մեծարենց</h2>
                   <div className='content-cont'>
                       <p>
                         Միսաք Մեծարենցը ծնվել է 1886 թվականի հունվարին, Արևմտյան Հայաստանի Ակնա գավառի Բինկյան (Բինկա) գյուղում, որը գտնվում է Եփրատ գետի ձախ ափին։ Գյուղը երեք կողմից շրջապատված էր ժայռերով ու կիրճերով, իսկ մի կողմից՝ գետով, ուստի դիմացի դաշտի հետ կապվում էր գիշերը փակվող կամրջով, որը թշնամու հարձակման ժամանակ գետի վրայից վերցնում էին և թույլ չէին տալիս թշնամուն գյուղ մտնել։ Նշանավոր բանահավաք Գարեգին Սրվանձտյանը գրում է, որ Բինկյան գյուղի բնակիչները զենք ունեին. «Ամեն սենյակի մեկ կողմն գիրք շարած են, երկու կողմն զենքեր, մեկ կողմն ալ փորի պետքեր»։ Այս միջավայրում Մեծարենցի մեջ տպավորվում է ավելի շատ գրքի, քան զենքի պաշտամունքը, մանավանդ որ նա խառնվածքով ամաչկոտ էր ու լռակյաց, խուսափում էր ընկերական շրջապատից և հասակին բնորոշ չարաճճիություններից։ 1892 թվականին՝ վեց տարեկան հասակում, ապագա բանաստեղծը հաճախում է գյուղի Մեսրոպյան վարժարանը, որտեղ իր վեհերոտ բնավորության պատճառով աչքի չի ընկնում ուսման մեջ։
                         1895 թվականին Մեծատուրյանների ընտանիքը տեղափոխվում է Սեբաստիա (Սվազ) քաղաքը, որտեղ Միսաքը սկզբնապես սովորում է Արամյան վարժարանում, իսկ 1896 թվականից տեղափոխվում է Մարզվանի՝ ամերիկյան միսիոներների «Անատոլիա» կոչվող գիշերօթիկ քոլեջ։ Այստեղ նա աստիճանաբար ձեռք է բերում ընկերներ, դառնում ավելի շփվող, մասնակցում աշակերտների կազմակերպած թատերական ներկայացումներին։ Մեծարենցը քոլեջում հետաքրքրություն է ցուցաբերում գեղարվեստական գրականության հանդեպ, կարդում է գրականություն հայերենով, անգլերենով, թուրքերենով։ Հենց այս շրջանում է, որ ի հայտ է գալիս նրա ստեղծագործելու ունակությունը. նա սկսում է իր գրական առաջին փորձերը։ Ինչպես և հայտնում են հուշագիրները, նա բանաստեղծություններ է գրում իր ննջարանի պատերին, եղբոր առևտրական թերթերի հակառակ կողմում։
                         1901 թվականին Սվազում Միսաքի հետ կատարվում է մի դեպք, որը ճակատագրական է դառնում նրա համար։ Թուրք մսագործ տղաները նրան շփոթում են իրենց հակառակորդի հետ, նրան ծեծի են ենթարկում և դանակահարում, ինչն էլ դառնում է բանաստեղծի՝ թոքախտով հիվանդանալու պատճառը։ Նա մի քանի ամիս բուժվում է Սուրբ Հակոբի վանքում։ 1901-1902 թվականներին Մեծարենցը աշխատել է եղբոր և հորեղբորորդու առևտրական տանը՝ իբրև հսկիչ։ 1902 թվականին նա գնում է հոր մոտ՝ Պոլիս, և սկսում է սովորել Կեդրոնական վարժարանում, սակայն հիվանդության պատճառով 1905 թվականին կիսատ է թողնում ուսումը։ Այդ ընթացքում նա արդեն աշխատում էր պարբերական մամուլում։ Միսաք Մեծարենցը վախճանվեց 1908 թվականի հունիսի 21-ի լույս 22-ի գիշերը։ Բանաստեղծի կենսագիր Թ. Ազատյանը այսպես է նկարագրում նրա մահը. «Մեծարենցի վերջին հրաժեշտը հուզիչ է ու եղերական։ Կերթա մահվան անվրդով ու գիտակցությամբ...Հոգեվարքը կըսկսի աքաղաղներու կանչեն պահ մը առաջ, շաբթեն կիրակի լուսանալու գիշերը, երբ Միսաք կը խնդրե մորմեն առանձին թողուլ զինքը. «Մա՛յր, մյուս սենյակը... հանգստացիր...կը հատնե սիրտս... կը կանչեմ եկուր..»: Ու մայրը մինչ արցունք կը թափեր դուրսը հողին վրա, դրան բացվածքեն կիմանա մահամերձին երեք անգամ հազալը. ու «Մա՜յր...» հոգին տված է արդեն»։ Հայ մեծանուն բանաստեղծը թաղված է Պոլսի Պալիքլի գերեզմանատանը։
                       </p>
                    </div>
                </div>
         </div>
        
    </div>
}

function Footer(){
    return <div>
        
    </div>
}