import { createSlice } from "@reduxjs/toolkit";
import "./astxaspyur"


export const astxaStateSlice = createSlice({
  name: "astxaState",
  initialState: {
    information: `Աստղասփյուռներ, համատեղ ծագում և գրեթե ընդհանուր ֆիզիկական հատկություններ ունեցող աստղերի ցրված, անկայուն խմբեր՝ պարփակված 30 - 200 պս չափեր ունեցող առանձին ծավալներում։

    Հայտնագործել է Վիկտոր Համբարձումյանը 1947 թվականին։ Աստղերի շարժման արագությունները աստղասփյուռներում բավարար են, որպեսզի նրանք հեռանան իրարից։ Աստղասփյուռները այդ պատճառով աստիճանաբար ընդարձակվում են և քայքայվում։ Վ. Համբարձումյանի կանխագուշակմամբ աստղասփյուռների ընդարձակման արագությունը 10 կմ/վրկ կարգի է, որը հետագայում հաստատվեց անմիջական չափումներով։ Ըստ հաշվարկների, ընդամենը մի քանի տասնյակ միլիոն տարվա ընթացքում աստղասփյուռները պետք է քայքայվեն, իսկ նրանց մեջ մտնող աստղերը խառնվեն շրջապատի աստղերին։ Քանի որ աստղասփյուռներ դեռ դիտվում են, ապա այդ ժամանակամիջոցը դեռ չի անցել, ուստի նրանց մեջ մտնող աստղերի տարիքը մի քանի տասնյակ միլիոն տարուց մեծ լինել չի կարող։ Եթե նկատի ունենանք, որ Գալակտիկայի աստղերի մեծ մասի տարիքը հաշվվում է մոտ տասը միլիարդ տարի, ապա ակնհայտ է, որ աստղասփյուռները երիտասարդ կազմավորումներ են։ Գալակտիկայում շարունակ առաջանում և քայքայվում են աստղասփյուռներ։ Նշանակում է աստղառաջացման պրոցեսը Գալակտիկայում շարունակվում է։ Աստղասփյուռները այն օջախներն են, որտեղ ձևավորվում են աստղերը։ Ըստ երևույթին, աստղերն առաջանում են աստղասփյուռների ծավալում գտնվող ցածր լուսատվության գերխիտ մարմիններից՝ նախաստղերից։
    
    Աստղասփյուռների գոյությունից բխող հետևությունները բացառում են նախկինում իշխող այն տեսակետը, ըստ որի, Գալակտիկայի բոլոր աստղերը առաջացել են միաժամանակ՝ ինչ-որ հեռավոր անցյալում։ Աստղասփյուռների ցուցակը կազմվել է Բյուրականում (նախնականը հրատարակել է Վ. Համբարձումյանը, իսկ լրացումներով և ուղղումներով՝ Բ. Մարգարյանը)։ Աստղասփյուռների հայտնագործման և հետազոտման համար Վ. Համբարձումյանը և Բ. Մարգարյանը արժանացել են ԽՍՀՄ պետական մրցանակի (1950)։
    
    Վիկտոր Համբարձումյանը առանձնացրել է O և T տիպի աստղասփյուռներ, երրորդ R տիպը, ավելի ուշ առաջարկել է Սիդնեյ վան դեն Բերգը այն աստղասփյուռների համար, որոնք ներառում են անդրդադարձնող միգամածություններ։`,
    image: 'https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Orion.Nebula.M42.Trapezium.Cluster.VIS-IR.HST.jpg/300px-Orion.Nebula.M42.Trapezium.Cluster.VIS-IR.HST.jpg',
    
  },
  reducers:{
    setInfo:(state)=>{
      state.information=`Աստղասփյուռներ, համատեղ ծագում և գրեթե ընդհանուր ֆիզիկական հատկություններ ունեցող աստղերի ցրված, անկայուն խմբեր՝ պարփակված 30 - 200 պս չափեր ունեցող առանձին ծավալներում։

      Հայտնագործել է Վիկտոր Համբարձումյանը 1947 թվականին։ Աստղերի շարժման արագությունները աստղասփյուռներում բավարար են, որպեսզի նրանք հեռանան իրարից։ Աստղասփյուռները այդ պատճառով աստիճանաբար ընդարձակվում են և քայքայվում։ Վ. Համբարձումյանի կանխագուշակմամբ աստղասփյուռների ընդարձակման արագությունը 10 կմ/վրկ կարգի է, որը հետագայում հաստատվեց անմիջական չափումներով։ Ըստ հաշվարկների, ընդամենը մի քանի տասնյակ միլիոն տարվա ընթացքում աստղասփյուռները պետք է քայքայվեն, իսկ նրանց մեջ մտնող աստղերը խառնվեն շրջապատի աստղերին։ Քանի որ աստղասփյուռներ դեռ դիտվում են, ապա այդ ժամանակամիջոցը դեռ չի անցել, ուստի նրանց մեջ մտնող աստղերի տարիքը մի քանի տասնյակ միլիոն տարուց մեծ լինել չի կարող։ Եթե նկատի ունենանք, որ Գալակտիկայի աստղերի մեծ մասի տարիքը հաշվվում է մոտ տասը միլիարդ տարի, ապա ակնհայտ է, որ աստղասփյուռները երիտասարդ կազմավորումներ են։ Գալակտիկայում շարունակ առաջանում և քայքայվում են աստղասփյուռներ։ Նշանակում է աստղառաջացման պրոցեսը Գալակտիկայում շարունակվում է։ Աստղասփյուռները այն օջախներն են, որտեղ ձևավորվում են աստղերը։ Ըստ երևույթին, աստղերն առաջանում են աստղասփյուռների ծավալում գտնվող ցածր լուսատվության գերխիտ մարմիններից՝ նախաստղերից։
      
      Աստղասփյուռների գոյությունից բխող հետևությունները բացառում են նախկինում իշխող այն տեսակետը, ըստ որի, Գալակտիկայի բոլոր աստղերը առաջացել են միաժամանակ՝ ինչ-որ հեռավոր անցյալում։ Աստղասփյուռների ցուցակը կազմվել է Բյուրականում (նախնականը հրատարակել է Վ. Համբարձումյանը, իսկ լրացումներով և ուղղումներով՝ Բ. Մարգարյանը)։ Աստղասփյուռների հայտնագործման և հետազոտման համար Վ. Համբարձումյանը և Բ. Մարգարյանը արժանացել են ԽՍՀՄ պետական մրցանակի (1950)։`
    },
    setInfoO_Type:(state)=>{
      state.information=`O աստղասփյուռները աստղային այն խմբերն են, որոնց մեջ բարձր լուսատվության ջերմ հսկա աստղերի (O - B2 սպեկտրալ դասեր) խտությունը շատ անգամ գերազանցում է շրջապատող դաշտում այդ նույն դասի աստղերի միջին խտությունը։ Միաժամանակ, աստղասփյուռների բոլոր աստղերի տարածական խտությունը, անկախ նրանց սպեկտրալ դասից, շատ անգամ ավելի փոքր է, քան շրջապատող դաշտինը։ O աստղասփյուռների մեջ որպես կորիզներ մտնում են բաց աստղակույտեր, Օրիոնի տրապեցիայի տիպի բազմաստղեր և աստղային շղթաներ։ Բացի սովորական ջերմ հսկաներից O աստղասփյուռների մեջ հանդիպում են այնպիսի բացառիկ օբյեկտներ, ինչպիսիք են Վոլֆ-Ռայեի և Բ Կարապի տիպի աստղերն ու սառը գերհսկա փոփոխականները։ O աստղասփյուռների դասական օրինակներ են Կարապի և Պերսևսի համաստեղության մեջ գտնվող մեծ աստղասփյուռները։

      Բարձր լուսատվության շնորհիվ O աստղասփյուռները դիտվում են նաև արտաքին գալակտիկաներում, նրանցով հարուստ են պարուրաձև և անկանոն գալակտիկաները։ Փաստորեն O աստղասփյուռներով են ուրվագծվում պարուրաձև գալակտիկաների թևերը։
      `
    },
    setInfoT_Type:(state)=>{
      state.information=`T Ցուլի տիպի փոփոխականները, որոնք օժտված են ցածր լուսատվությամբ և հայտնի են իբրև անկայուն աստղեր, նույնպես հանդես են գալիս ցրված խմբերով, որոնք կոչվում են T աստղասփյուռներ։ Գոյություն ունեն նաև խառն աստղասփյուռներ, որոնք պարունակում են ինչպես ջերմ հսկաներ ու գերհսկաներ, այնպես էլ T Ցուլի տիպի անկայուն փոփոխականներ։ Այդպիսիք են Միաեղջյուրի և Օրիոնի աստղասփյուռները։

      Արտաքին գալակտիկաներում T աստղասփյուռների հայտնաբերմանը խանգարում է նրանց ցածր լուսատվությունը։`
    },
    setInfoR_Type:(state)=>{
      state.information=`Այս երիտասարդ աստղերի խմբերը պարունակում են հիմնական շարքի աստղերի տեսակներ, որոնք բավարար զանգվածեղ չեն, որպեսցի ցրեն նրանց շրջապատող միջաստղային նյութի ամպերը, որոնցում նրանք առաջացել են։`
    },

  }
});

export const {setInfo, setInfoO_Type, setInfoR_Type, setInfoT_Type}=astxaStateSlice.actions
