import { createSlice } from "@reduxjs/toolkit";
import "./astxaspyur"


export const astxaStateSlice = createSlice({
  name: "astxaState",
  initialState: {
    information: `Աստղասփյուռներ, համատեղ ծագում և գրեթե ընդհանուր ֆիզիկական հատկություններ ունեցող աստղերի ցրված, անկայուն խմբեր՝ պարփակված 30 - 200 պս չափեր ունեցող առանձին ծավալներում։

    Հայտնագործել է Վիկտոր Համբարձումյանը 1947 թվականին։ Աստղերի շարժման արագությունները աստղասփյուռներում բավարար են, որպեսզի նրանք հեռանան իրարից։ Աստղասփյուռները այդ պատճառով աստիճանաբար ընդարձակվում են և քայքայվում։ Վ. Համբարձումյանի կանխագուշակմամբ աստղասփյուռների ընդարձակման արագությունը 10 կմ/վրկ կարգի է, որը հետագայում հաստատվեց անմիջական չափումներով։ Ըստ հաշվարկների, ընդամենը մի քանի տասնյակ միլիոն տարվա ընթացքում աստղասփյուռները պետք է քայքայվեն, իսկ նրանց մեջ մտնող աստղերը խառնվեն շրջապատի աստղերին։ Քանի որ աստղասփյուռներ դեռ դիտվում են, ապա այդ ժամանակամիջոցը դեռ չի անցել, ուստի նրանց մեջ մտնող աստղերի տարիքը մի քանի տասնյակ միլիոն տարուց մեծ լինել չի կարող։ Եթե նկատի ունենանք, որ Գալակտիկայի աստղերի մեծ մասի տարիքը հաշվվում է մոտ տասը միլիարդ տարի, ապա ակնհայտ է, որ աստղասփյուռները երիտասարդ կազմավորումներ են։ Գալակտիկայում շարունակ առաջանում և քայքայվում են աստղասփյուռներ։ Նշանակում է աստղառաջացման պրոցեսը Գալակտիկայում շարունակվում է։ Աստղասփյուռները այն օջախներն են, որտեղ ձևավորվում են աստղերը։ Ըստ երևույթին, աստղերն առաջանում են աստղասփյուռների ծավալում գտնվող ցածր լուսատվության գերխիտ մարմիններից՝ նախաստղերից։
    
    Աստղասփյուռների գոյությունից բխող հետևությունները բացառում են նախկինում իշխող այն տեսակետը, ըստ որի, Գալակտիկայի բոլոր աստղերը առաջացել են միաժամանակ՝ ինչ-որ հեռավոր անցյալում։ Աստղասփյուռների ցուցակը կազմվել է Բյուրականում (նախնականը հրատարակել է Վ. Համբարձումյանը, իսկ լրացումներով և ուղղումներով՝ Բ. Մարգարյանը)։ Աստղասփյուռների հայտնագործման և հետազոտման համար Վ. Համբարձումյանը և Բ. Մարգարյանը արժանացել են ԽՍՀՄ պետական մրցանակի (1950)։
    
    Վիկտոր Համբարձումյանը առանձնացրել է O և T տիպի աստղասփյուռներ, երրորդ R տիպը, ավելի ուշ առաջարկել է Սիդնեյ վան դեն Բերգը այն աստղասփյուռների համար, որոնք ներառում են անդրդադարձնող միգամածություններ։`,
    image: 'https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Orion.Nebula.M42.Trapezium.Cluster.VIS-IR.HST.jpg/300px-Orion.Nebula.M42.Trapezium.Cluster.VIS-IR.HST.jpg',
    
  },
  reducers:{

  }
});
