import './style.css'
import { useNavigate, Route, Routes  } from "react-router-dom";

function Victor(){
    const navigate = useNavigate()
    
   return( 
       <>
       <h1 style={{
           display: 'flex',
           justifyContent: 'center',
           
           marginTop: '20px'
    }}>Վիկտոր Համբարձումյան</h1>
    <div className="header">
    <div id="img1"></div>
    <div>
        <ul>
            {/* <li><button onClick={()=>{navigate('/mek')}}>1. Կենսագրություն</button></li>
            <li><button onClick={()=>{navigate('/erku')}}>2. Գիտական գործունեության հիմնական ուղղությունները</button></li>
            <li><button onClick={()=>{navigate('/ereq')}}>3. Մանկավարժական գործունեություն</button></li>
            <li><button onClick={()=>{navigate('/chors')}}>4. Գիտա-կազմակերպչական գործունեություն</button></li>
            <li><button onClick={()=>{navigate('/hing')}}>5. Հասարակական-քաղաքական գործունեություն</button></li>
            <li><button onClick={()=>{navigate('/vec')}}>6. Անդամակցությունը գիտական կազմակերպություններին</button></li>
            <li><button onClick={()=>{navigate('/yot')}}>7. Պարգևներ և կոչումներ</button></li> */}
        </ul>
    </div>
    </div>
    <Routes>
            {/* <Route path="/" element={<Victor/>}/>
            <Route path="mek/*" element={<ListOne/>}/>
            <Route path="erku/*" element={<ListTwo/>}/>
            <Route path="ereq/*" element={<ListThree/>}/>
            <Route path="chors/*" element={<ListFour/>}/>
            <Route path="hing/*" element={<ListFive/>}/>
            <Route path="vec/*" element={<ListSix/>}/>
            <Route path="yot/*" element={<ListSeven/>}/> */}
       </Routes>
 
    </>
   );

}

function ListOne(){
    console.log('aa')
    return(
         <div className="information">
            
        <p>Վիկտոր Համբարձումյանը ծնվել է Թիֆլիսում, 1908 թվականի սեպտեմբերի 18-ին։ Հայրը՝ Համազասպ Համբարձումյանը եղել է
             իրավաբան, գրականագետ։ Նկատելով երեք-չորս տարեկան որդու՝ թվերի նկատմամբ ունեցած մեծ հետաքրքրությունը, հայրն 
             ավելի լրջորեն է զբաղվում օժտված զավակով՝ զարգացնելով նրա բնատուր բնագիտական ձիրքը[15]։ Դպրոցական տարիներին 
             առավել ցայտուն են դրսևորվում մաթեմատիկայի և աստղագիտության նկատմամբ նրա հակումները։ Այդ տարիներին արդեն 
             հրապարակային դասախոսություններ է կարդում ֆիզիկայի և աստղագիտության խնդիրների վերաբերյալ։ 1924 թվականի 
             մարտին 15-ամյա Համբարձումյանը Երևանի պետական համալսարանում անվանի պրոֆեսորների, դասախոսների ուսանողների 
             և աշակերտների համար դասախոսություն է կարդում Ալբերտ Էյնշտեյնի հարաբերականության տեսության վերաբերյալ, 
             որն ընդունվում է մեծ հետաքրքրությամբ[15]։ Մի քանի ամիս անց նույն դասախոսությունը կրկնում է Թիֆլիսում[15]։

            1924 թվականին Վիկտորն ընդունվում է Լենինգրադի մանկավարժական ինստիտուտի ֆիզիկա-մաթեմատիկական բաժինը։ Մեկ 
            տարի անց տեղափոխվում է Լենինգրադի պետական համալսարան։ 1926 թվականին, տակավին ուսանող, նա հրատարակում է իր
             առաջին գիտական հոդվածը՝ նվիրված արեգակնային ջահերին։ Ուսանողական տարիներին տպագրում է ավելի քան 15 հոդված։
              Համալսարանն ավարտելուց հետո, 1928-1931 թվականներին Վ.Համբարձումյանն ուսանել է Պուլկովոյի աստղադիտարանի
               ասպիրանտուրայում՝ ակադեմիկոս Ա․ Բելոպորսկու ղեկավարությամբ։ 1934 թվականին Լենինգրադի համալսարանում չորս
                տարի աշխատելուց հետո, Համբարձումյանը հիմնադրում և ղեկավարում է ԽՍՀՄ առաջին աստղաֆիզիկայի ամբիոնը։</p>

        </div>
        
    );
}

function ListTwo(){
    return(
        <div>
            <p>Աստղերի թաղանթների և գազային միգամածությունների ֆիզիկա
            1932 թվականին Լոնդոնի Թագավորական աստղագիտական ընկերության «Monthly Notices» հանդեսը հրապարակեց Համբարձումյանի 
            «On the radiative equilibrium of a planetary nebula» (Մոլորակաձև միգամածության ճառագայթման հավասարակշռության մասին) 
            հոդվածը, որն այժմ համարվում է գազային միգամածությունների ժամանակակից տեսության անկյունաքարը։ Այդ խնդրին է նվիրված 
            Համբարձումյանի աշխատությունների մի ամբողջ շարք, որոնցում ստեղծված է աստղերի գազային թաղանթների և գազային 
            միգամածությունների տեսության հենքը և բացատրված են դրանց սպեկտրերի մի շարք առանձնահատկություններ։ Նրա մշակած եղանակները 
            կիրառվել են անկայուն աստղերի գազային թաղանթների հետազոտման համար։ Այդ աշխատություններից մեկում (Ն. Ա. Կոզիրևի հետ համատեղ) 
            հաջողվել է առաջին անգամ գնահատել նոր աստղերի արտանետած գազային թաղանթների զանգվածները։ Այդ զանգվածների գնահատականը շատ 
            էական դեր ունեցավ աստղերի զարգացման խնդիրները դիտարկելիս։ Մասնավորապես, այն հնարավորություն ընձեռեց հայտնաբերել աստղային
            անկայունության ամենաաննշան դրսևորումները։</p>
        </div>
    );

}

function ListThree(){
return(
    <div className="information">
            
    <p>Համբարձումյանը գիտական աշխատանքը զուգակցել է աշխույժ մանկավարժական գործունեության հետ։ Նա հեղինակն է
         տեսական աստղաֆիզիկա առարկայի՝ ԽՍՀՄում առաջին դասագրքի (1939) և հեղինակակիցն է «Տեսական աստղաֆիզիկայի»
          դասընթացի (1952), որը թարգմանված է բազմաթիվ լեզուների։ 1931 թվաակնից դասախոսություններ է կարդացել Լենինգրադի 
          համալսարանում։ 1934 թվականին Լենինգրադի համալսարանում հիմնել է ԽՍՀՄ առաջին աստղաֆիզիկայի ամբիոնը, որ ղեկավարել 
          է մինչև 1947 թվականը։ 1939-1941 թվականներին եղել է Լենինգրադի համալսարանի աստղադիտարանի տնօրենը, իսկ 1940 
          թվականից՝ նույն համալսարանի գիտական պրոռեկտորը։ 1941-1943 թվականները եղել է Լենինգրադի համալսարանի տարհանված
           գիտական մասնաճյուղի վարիչը Ելաբուգայում։ 1944 թվականին աստղաֆիզիկայի ամբիոն է հիմնում Երևանի համալսարանում։
            Համբարձումյանը գիտական դպրոցներ է հիմնել Լենինգրադում և Բյուրականում, որոնք զգալի հետք են թողել
            աստղագիտության տարբեր ճյուղերի զարգացման վրա։ Գիտության ժողովրդականացման-տարածման ջատագով էր, հեղինակ
            աստղաֆիզիկայի զանազան խնդիրներին նվիրված բազմաթիվ հոդվածների և գրքերի։</p>

    </div>
);
}
function ListFour(){
    return(
        <div className="information">
            
        <p>Համբարձումյանը գիտության երևելի կազմակերպիչ էր Հայաստանում, Ռուսաստանում և միջազգային ասպարեզում։ Եղել է 
            Բյուրականի աստղադիտարանի հիմնադիրն ու տնօրենը, Հայաստանի Գիտությունների Ակադեմիայի փոխնախագահ ու նախագահ, 
            ԽՍՀՄ Գիտությունների Ակադեմիայի նախագահության անդամ, Միջազգային Աստղագիտական Միության փոխնախագահ (1948–1955) 
            և նախագահ (1961-1964), Գիտական Միությունների Միջազգային Խորհրդի (ICSU) նախագահ՝ բացառության կարգով 
            ընտրվելով երկու անգամ (1968–1970 թթ․, 1970–1972 թթ․)</p>

        </div>
    );

}
function ListFive(){
    return(
        <div className="information">
            
        <p>1940 թվականին Վ. Համբարձումյանը դարձել է Խորհրդային Միության կոմունիստական կուսակցության անդամ։ 1947-ին ընտրվել
             է Հայկական ԽՍՀ Գերագույն խորհրդի պատգամավոր։ 1950–1990 թվականներին բոլոր գումարումների ԽՍՀՄ Գերագույն խորհրդի
              պատգամավոր է ընտրվել, եղել է ԽՄԿԿ 19, 22–25-րդ համագումարների պատգամավոր։ 1989-ին ընտրվել է ԽՍՀՄ Ժողովրդական
               պատգամավորների համագումարի պատգամավոր։ 1948–1989 թվականներին Հայաստանի կոմունիստական կուսակցության 
               կենտրոնական կոմիտեի անդամ է եղել, Հայաստանում գիտության պետական հովանավորության քաղաքականության պատասխանատուն։</p>

        </div>
    );

}
function ListSix(){
    return(
        <div className="information">
            
        <ul>
            <li>Ավստրիայի գիտությունների ակադեմիա</li>
            <li>Ադրբեջանի ԽՍՀ գիտությունների ակադեմիա</li>
            <li>Բելգիայի գիտությունների ակադեմիա</li>
            <li>Գերմանիայի դեմոկրատական հանրապետության գիտությունների ակադեմիա</li>
            <li>Վրաստանի գիտությունների ակադեմիա</li>
            <li>Դանիայի գիտությունների ակադեմիա</li>
            <li>Իտալիայի գիտությունների ակադեմիա</li>
            <li>Լա-Պլատայի համալսարան</li>
            <li>Փարիզի համալսարան</li>
            <li>Պրագայի համալսարան</li>
        </ul>

        </div>
    );

}
function ListSeven(){
    return(
        <div className="information">
            <ul>
                <li>Հայաստանի ազգային հերոս </li>
                <li>Սոցիալիստական աշխատանքի կրկնակի հերոս </li>
                <li>Ռուսաստանի Դաշնության պետական մրցանակ </li>
                <li>Հայաստանի ԽՍՀ պետական մրցանակ</li>
                <li>Հինգ Լենինի շքանշան</li>
                <li>Պատվո շքանշան</li>
                <li>Լեհաստանի Հանրապետության Վաստակի շքանշանի կոմանդոր</li>
                <li>Հայաստանի ԽՍՀ գիտության վաստակավոր գործիչ</li>
            </ul>
        </div>
    );

}




export default Victor
