import React from "react";
import './style.css'

function First(){
   return( 
       <>
       <h1 style={{
           display: 'flex',
           justifyContent: 'center',
           marginTop: '20px'
    }}>Վիկտոր Համբարձումյան</h1>
    <div className="header">
    <div id="img1"></div>
    <div>
        <ul>
            <li><button onClick={ListOne()}>1. Կենսագրություն</button></li>
            <li><button onClick={ListTwo()}>2. Գիտական գործունեության հիմնական ուղղությունները</button></li>
            <li><button onClick={ListThree()}>3. Մանկավարժական գործունեություն</button></li>
            <li><button onClick={ListFour()}>4. Գիտա-կազմակերպչական գործունեություն</button></li>
            <li><button onClick={ListFive()}>5. Հասարակական-քաղաքական գործունեություն</button></li>
            <li><button onClick={ListSix()}>6. Անդամակցությունը գիտական կազմակերպություններին</button></li>
            <li><button onClick={ListSeven()}>7. Պարգևներ և կոչումներ</button></li>
            <li><button onClick={ListEight()}>8. Վիկտոր Համբարձումյանի անվան միջազգային գիտական մրցանակ</button></li>
            <li><button onClick={ListNine()}>9. Պատկերասրահ</button></li>
            <li><button onClick={ListTen()}>10. Երկեր</button></li>
        </ul>
    </div>
   
    </div>
    <div className="information">{ListOne()} </div>
    </>
   );

}

function ListOne(){
    console.log('aa')
    return
    (
        
        <div className="listOne">
            
        <p>Վիկտոր Համբարձումյանը ծնվել է Թիֆլիսում, 1908 թվականի սեպտեմբերի 18-ին։ Հայրը՝ Համազասպ Համբարձումյանը եղել է
             իրավաբան, գրականագետ։ Նկատելով երեք-չորս տարեկան որդու՝ թվերի նկատմամբ ունեցած մեծ հետաքրքրությունը, հայրն 
             ավելի լրջորեն է զբաղվում օժտված զավակով՝ զարգացնելով նրա բնատուր բնագիտական ձիրքը[15]։ Դպրոցական տարիներին 
             առավել ցայտուն են դրսևորվում մաթեմատիկայի և աստղագիտության նկատմամբ նրա հակումները։ Այդ տարիներին արդեն 
             հրապարակային դասախոսություններ է կարդում ֆիզիկայի և աստղագիտության խնդիրների վերաբերյալ։ 1924 թվականի 
             մարտին 15-ամյա Համբարձումյանը Երևանի պետական համալսարանում անվանի պրոֆեսորների, դասախոսների ուսանողների 
             և աշակերտների համար դասախոսություն է կարդում Ալբերտ Էյնշտեյնի հարաբերականության տեսության վերաբերյալ, 
             որն ընդունվում է մեծ հետաքրքրությամբ[15]։ Մի քանի ամիս անց նույն դասախոսությունը կրկնում է Թիֆլիսում[15]։

            1924 թվականին Վիկտորն ընդունվում է Լենինգրադի մանկավարժական ինստիտուտի ֆիզիկա-մաթեմատիկական բաժինը։ Մեկ տարի անց տեղափոխվում է Լենինգրադի պետական համալսարան։ 1926 թվականին, տակավին ուսանող, նա հրատարակում է իր առաջին գիտական հոդվածը՝ նվիրված արեգակնային ջահերին։ Ուսանողական տարիներին տպագրում է ավելի քան 15 հոդված։ Համալսարանն ավարտելուց հետո, 1928-1931 թվականներին Վ.Համբարձումյանն ուսանել է Պուլկովոյի աստղադիտարանի ասպիրանտուրայում՝ ակադեմիկոս Ա․ Բելոպորսկու ղեկավարությամբ։ 1934 թվականին Լենինգրադի համալսարանում չորս տարի աշխատելուց հետո, Համբարձումյանը հիմնադրում և ղեկավարում է ԽՍՀՄ առաջին աստղաֆիզիկայի ամբիոնը։</p>

        </div>
        
    );
}

function ListTwo(){

}

function ListThree(){

}
function ListFour(){

}
function ListFive(){

}
function ListSix(){

}
function ListSeven(){

}
function ListEight(){

}
function ListNine(){

}
function ListTen(){

}

export default First
