import { combineReducers } from "redux";
import firstStateSlice from "./index";
import { configureStore, createSlice } from "@reduxjs/toolkit";

const firstStateSlice = createSlice({
  name: "firsState",
  initialState: {
    info: "Համո Սահյանը ծնվել է 1914 թվականի ապրիլի 14-ին Սիսիանի շրջանի (այժմ՝ Սյունիքի մարզ) Լոր գյուղում։ Սահյանը սկզբնական կրթությունը ստացել է տեղի դպրոցում, որտեղ իբրև ուսուցիչ աշխատել էին բանաստեղծներ Գառնիկ Քալաշյանը և Ակսել Բակունցը։ 1927 թվականին Հ. Սահյանը տեղափոխվել է Բաքու, որտեղ ստացել է միջնակարգ կրթություն։ 1935 թվականին ընդունվել և 1939 թվականին ավարտել է Բաքվի մանկավարժական ինստիտուտի հայկական բաժանմունքը։ 1939-1941 թվականներին աշխատել է Բաքվի «Խորհրդային գրող» ամսագրում որպես գրական աշխատող։ Որպես Կասպիական նավատորմի նավաստի,մասնակցել է նաև Հայրենական մեծ պատերազմին (1941–1945 թթ.)։ 1944 թվականին Ստեփան Զորյանի հրավերով գալիս է Երևան և բնակություն հաստատում նրա տանը։ Հենց Զորյանի օգնությամբ է Սահյանը ստեղծել իր առաջին գիրքը՝ «Որոտանի եզերքին» վերնագրով։ 1965-1967 թվականներին եղել է «Գրական թերթ»-ի գլխավոր խմբագիրը։ Մահացել է 1993 թվականի հուլիսի 17-ին Երևանում։ Նրա աճյունը տեղ է գտել Կոմիտասի անվան պանթեոնում։",
    // data: null,
  },
  // reducers: {
  //   setData: (state) => {
  //     state.name = ""
  //   },
  // }
});
export const { setData } = firstStateSlice.actions;
export const rootReducer = combineReducers({
  firsState: firstStateSlice.reducer,
});
export const store = configureStore({
  reducer: rootReducer,
});
window.store = store;
