import React from 'react'
import './Banastexcutyunner.css';

function Banastexcutyunner() {
  const about3 = <div>
<h1>Բանաստեղծություններ</h1>
<p><i>Համո Սահյանի ստեղծագործության մեջ մեծ թիվ են կազմում անցյալին, մանկությանը նվիրված բանաստեղծությունները, որոնք ունեն արդիական իմաստավորում, հասարակական հնչեղություն։ Նա իրեն հատուկ բառամթերքով անդրադարձնելով իր զգայական աշխարհը` հասնում է լեզվաոճական ինքնատիպության ու կայունության։ Նա թարգմանել է Ա. Պուշկինի, Ս. Եսենինի, Գ. Լորկայի և այլ բանաստեղծների ստեղծագործություններից։ Սահյանի բանաստեղծություններում անձինք են համարվում անձրևը, ծառը, կայծակը, գետը, լիճը և այլն։</i></p>
</div>
  return (
    <>
    <div className='container'>
  <div className='parent3'>
    <div className='parent3_child1'>{about3}
    <ul>
      <li>Ախր ես ինչպես վեր կենամ գնամ</li>
      <li>Անունդ տալիս</li>
      <li>Անտառում</li>
      <li>Գարունդ հայերեն է գալիս</li>
      <li>Եվ չիմացանք, թե ինչու</li>
      <li>Թռավ գնաց</li>
      <li>Հայաստան ասելիս</li>
      <li>Հայոց լեզու</li>
      <li>Հայրենական տուն</li>
      <li>Հայրենի հեռավոր ձորում</li>
      <li>Մեր լեզուն</li>
      <li>Նաիրյան դալար բարդի</li>
      <li>Ուր էլ որ գնամ</li>
      <li>Պապը</li>
      <li>Քարափը</li>
      <li>Մասրենին</li>
      <li>Երևան</li>
      <li>Արաքս</li>
      <li>Ուր որ նայում եմ</li>
      <li>Տար ինձ, ժամանակ</li>
      <li>Այս քարանձավներն</li>
      <li>Սարահովիտ</li>
      <li>Երեխայի պես</li>
     <span >...  ... ...</span>
    </ul>
    </div>
  </div>
</div>
    </>
  )
}

export default Banastexcutyunner
