import React from "react";
import styles from "./styles/sahyan.module.scss";

function GrakanGorcuneutyun() {
  const about2 = (
    <div>
      <h1>Գրական գործունեություն</h1>
      <h4>Առաջին շրջան</h4>
      <br />
      <p>
        <i>
          Աշխատել է Սիսիանի շրջանային թերթում (1937-1938), «Խորհրդային գրող»
          ամսագրում (1938-1941), «Կոմունիստ» թերթում (1945-1951), այնուհետև՝
          Երևանի «Ավանգարդ» թերթում (1951-1954) և «Ոզնի» հանդեսում (1954-1965)։
          Համո Սահյանի բանաստեղծությունները տպագրվել են դեռևս 30-ական
          թվականներից, սակայն նա համընդհանուր ճանաչման է արժանացել ռազմաճակատում
          գրած «Նաիրյան դալար բարդի» բանաստեղծությամբ, որը հատկանշվում է
          Հայաստան երկրի հանդեպ կարոտի հուզական բռնկումով և անմիջականությամբ։
          1945 թվականին լույս է տեսել Սահյանի առաջին գիրքը՝ «Որոտանի եզերքին»
          վերնագրով։ Այստեղ դրսևորվում էր Սահյանի թեմատիկ և
          բանաստեղծական-դավանաբանական ընդհանուր ուղղվածությունը՝ ռեալիստական
          գուներանգներ, բնապատկերի գեղանկարչական ընկալում, խոսքի կառուցման
          ժողովրդական-բանահյուսական սկզբունք։ Հաջորդ՝ «Առագաստ» (1947), «Սլացքի
          մեջ» (1950), «Ծիածանը տափաստանում» (1953), «Բարձունքի վրա» (1955),
          «Նաիրյան դալար բարդի» (1958) ժողովածուներում ավելի է ընդլայնվում Համո
          Սահյանի պոեզիայի թեմատիկ ընդգրկումը
        </i>
      </p>
      <br />
      <h4>Երկրորդ շրջան</h4>
      <br />
      <p>
        <i>
          Ավարտվում է բանաստեղծի ստեղծագործության առաջին շրջանը և սկսվում նորը՝
          «Մայրամուտից առաջ» (1964), «Քարափների երգը» (1968), «Տարիներս» (1970)
          ժողովածուներով, որոնք նոր սկիզբ տվեցին Սահյանի ստեղծագործության մեջ.
          նրա քնարերգությունը հարստանում է թարմ արտահայտչաձևերով,
          բանաստեղծության ավանդական կառույցները նորոգվում են պատկերային նոր
          մտածողությամբ, ամրանում է բանաստեղծի կապն իր հոգևոր արմատների հետ։ Այդ
          գրքերում նա հանդես է գալիս նաև որպես գեղագետ-փիլիսոփա։ «Քարափների
          երգը» ժողովածուում քարափները ներկայացված են որպես մարդկության
          աղբյուրներ։ Ժողովածուի մի բանաստեղծության մեջ բանաստեղծը դիմում է իր
          ծննդավայրին և ասում է. «Քո սարերին եմ թիկնելու նորից»։ Համո Սահյանի
          ստեղծագործությունների թեմատիկայի մաս է կազմում նաև Հայաստանը։ 1972
          թվականին լույս է տեսնում Սահյանի «Սեզամ, բացվիր» ժողովածուն, որի համար
          1975 թվականին նա արժանանում է ՀԽՍՀ պետական մրցանակի։ 1977 թվականին
          տպագրվում է նրա «Իրիկնահաց», 1989 թվականին՝ «Կանաչ, կարմիր աշուն»,
          1986 թվականին՝ «Դաղձի ծաղիկ» ժողովածուները։ Այդ ժողովածուներով Սահյանը
          բերում է մարդկային դրամատիկ ապրումների ու ճակատագրի քնարերգությունը՝
          բանաստեղծության բնապաշտական տարերքը։
        </i>
      </p>
    </div>
  );
  return (
    <>
      <div className={styles.parent2}>
        <div className={styles.left}>
          <a href="kensagrutyun">
            <i class="fa-solid fa-circle-arrow-left"></i>
          </a>
        </div>

        <div className={styles.child_1}>{about2}</div>
        <div className={styles.right}>
          <a href="banastexcutyunner">
            <i class="fa-solid fa-circle-arrow-right"></i>
          </a>
        </div>
      </div>
    </>
  );
}

export default GrakanGorcuneutyun;
