import React from 'react'
import './Hishatak.css';

function Hishatak() {
  
const about4 = <div>
<h1>Հիշատակ</h1>
<p><i>2014 թվականի ապրիլի 14-ին՝ բանաստեղծի 100-ամյակին, նրա հայրենի գյուղում՝ Լորում, բացվել է տուն-թանգարան։ Թանգարանը երկհարկանի է, առաջին հարկում ցուցադրված են գյուղացիների կենցաղային իրերը, երկրորդ հարկում՝ Համո Սահյանի անձնական իրերը, բանաստեղծությունների ժողովածուները։ Ներկայումս թանգարանը շարունակում է համալրվել նոր ցուցանմուշներով։

Համո Սահյանի անունն է կրում Երևանի Արաբկիր վարչական շրջանի փողոցներից մեկը, Երևանի №70 հիմնական դպրոցը։

Սիսիանում կա նաև Համո Սահյանին նվիրված հուշարձան։

2007 թվականին Երևանի Կասյան փողոցում տեղադրվել է Համո Սահյանի հուշատախտակը, որի քանդակագործն է Գետիկ Բաղդասարյանը։

1975 թվականին գեղանկարիչ Հրանտ Ստեփանյանը վրձնել է Համո Սահյանի դիմանկարը, որը գտնվում է Չարենցի անվան արվեստի և գրականության թանգարանում։</i></p>
</div>
  return (
    <>
    <div className='container'>
  <div className='parent4'>
    <div className='parent4_child1'>{about4}
   
    </div>
  </div>
</div>
    </>
  )
}

export default Hishatak
