import React from 'react'
import './Sahyan.css';

function Sahyan() {
  return (
    <>
    {/* <nav className='App'></nav> */}
  <h1 style={{color:'#3c3b3b',fontFamily:"cursive"}}>Համո Սահյան</h1>
  <div className='container'>
    <section className='items'>

<div className='item1'>
  <h2 style={{textAlign:"center",margin: "15px",color:"darkslategray",fontFamily:"cursive",fontSize:"30px"}}>Համո Սահյան</h2>
  <div className='item1_1'></div>
  <table  style={{width:"290px"}}>
  <tr >
    <th>Ծննդյան անուն</th>
    <td >Հմայակ Սահակի Գրիգորյան</td>
  </tr>
  <tr>
    <th>Ծնվել </th>
  <td> <a href="#">ապրիլի 14, 1914</a></td>
  </tr>
  <tr>
    <th>Ծննդավայր</th>
    <td><a href='#'>Լոր, Զանգեզուրի գավառ, Ելիզավետպոլի նահանգ, Ռուսական կայսրություն</a></td>
  </tr>
  <tr>
    <th>Վախճանվել է</th>
    <td><a href='#'>հուլիսի 17, 1993 (79 տարեկան)</a></td>
  </tr>
  <tr>
    <th>Վախճանի վայր</th>
    <td><a href='#'>Երևան, Հայաստան[3]</a></td>
  </tr>
  <tr>
    <th>Գերեզման</th>
    <td><a href='#'>Գերեզման Համո Սահյանի և Կոմիտասի անվան զբոսայգու պանթեոն</a></td>
  </tr>
  <tr>
    <th>Մասնագիտություն	</th>
    <td><a href='#'>բանաստեղծ և թարգմանիչ</a></td>
  </tr>
  <tr>
    <th>Ազգություն</th>
    <td><a href='#'>հայ</a></td>
  </tr>
  <tr>
    <th>Քաղաքացիություն</th>
    <td><a href='#'>Ռուսական կայսրություն,  ԽՍՀՄ և Հայաստան</a></td>
  </tr>
  <tr>
    <th>Կրթություն</th>
    <td><a href='#'>Ադրբեջանի պետական մանկավարժական համալսարան (1939)</a></td>
  </tr>
  <tr>
    <th>Անդամակցություն	</th>
    <td><a href='#'>ԽՍՀՄ Գրողների միություն</a></td>
  </tr>
  <tr>
    <th>Կուսակցությու</th>
    <td><a href='#'>ԽՄԿԿ</a></td>
  </tr>
  <tr>
    <th>Աշխատավայր</th>
    <td><a href='#'>Ավանգարդ, Ոզնի և Գրական թերթ</a></td>
  </tr>
  </table>
  <div className='img'></div>
</div>
<div className='item2'>
  <h2>Գրական անուն</h2>
  <hr />
  <p>Սահյանն իր գրական անունը ստեղծել է հոր՝ Սահակի անվան առաջին մասի «ՍԱՀ» և ազգանվան վերջավորության «յան» համատեղումով։</p>
<br />
<h2>Կենսագրություն</h2>
<hr />
<p>Համո Սահյանը ծնվել է 1914 թվականի ապրիլի 14-ին Սիսիանի շրջանի (այժմ՝ Սյունիքի մարզ) Լոր գյուղում։ Սահյանը սկզբնական կրթությունը ստացել է տեղի դպրոցում, որտեղ իբրև ուսուցիչ աշխատել էին բանաստեղծներ Գառնիկ Քալաշյանը և Ակսել Բակունցը։ 1927 թվականին Հ. Սահյանը տեղափոխվել է Բաքու, որտեղ ստացել է միջնակարգ կրթություն։ 1935 թվականին ընդունվել և 1939 թվականին ավարտել է Բաքվի մանկավարժական ինստիտուտի հայկական բաժանմունքը։ 1939-1941 թվականներին աշխատել է Բաքվի «Խորհրդային գրող» ամսագրում որպես գրական աշխատող։ Որպես Կասպիական նավատորմի նավաստի, մասնակցել է նաև Հայրենական մեծ պատերազմին (1941–1945 թթ.)։ 1944 թվականին Ստեփան Զորյանի հրավերով գալիս է Երևան և բնակություն հաստատում նրա տանը։ Հենց Զորյանի օգնությամբ է Սահյանը ստեղծել իր առաջին գիրքը՝ «Որոտանի եզերքին» վերնագրով։ Զորյանի ուշադրությանը Սահյանը պատասխանել է ձոն-նվիրումով, որում եղել են այսպիսի տողեր.</p>
<div className='img2'></div>
<p style={{ textAlign:"center"}}> Դուք հոր նման խիստ եք եղել,<br />
Ու հոր նման ներող,<br />

Ձեր խորհուրդը խորն է եղել<br />

Ու խրատը՝ գերող։ </p>
<div className='img3'></div><br/>
<p>
1965-1967 թվականներին եղել է «Գրական թերթ»-ի գլխավոր խմբագիրը։

Մահացել է 1993 թվականի հուլիսի 17-ին Երևանում։ Նրա աճյունը տեղ է գտել Կոմիտասի անվան պանթեոնում։</p>
<br />
<h4>Գրական գործունեություն</h4>
<h5>Առաջին շրջան
</h5>
<p>Աշխատել է Սիսիանի շրջանային թերթում (1937-1938), «Խորհրդային գրող» ամսագրում (1938-1941), «Կոմունիստ» թերթում (1945-1951), այնուհետև՝ Երևանի «Ավանգարդ» թերթում (1951-1954) և «Ոզնի» հանդեսում (1954-1965)։

Համո Սահյանի բանաստեղծությունները տպագրվել են դեռևս 30-ական թվականներից, սակայն նա համընդհանուր ճանաչման է արժանացել ռազմաճակատում գրած «Նաիրյան դալար բարդի» բանաստեղծությամբ, որը հատկանշվում է Հայաստան երկրի հանդեպ կարոտի հուզական բռնկումով և անմիջականությամբ։

1945 թվականին լույս է տեսել Սահյանի առաջին գիրքը՝ «Որոտանի եզերքին» վերնագրով։ Այստեղ դրսևորվում էր Սահյանի թեմատիկ և բանաստեղծական-դավանաբանական ընդհանուր ուղղվածությունը՝ ռեալիստական գուներանգներ, բնապատկերի գեղանկարչական ընկալում, խոսքի կառուցման ժողովրդական-բանահյուսական սկզբունք։ Հաջորդ՝ «Առագաստ» (1947), «Սլացքի մեջ» (1950), «Ծիածանը տափաստանում» (1953), «Բարձունքի վրա» (1955), «Նաիրյան դալար բարդի» (1958) ժողովածուներում ավելի է ընդլայնվում Համո Սահյանի պոեզիայի թեմատիկ ընդգրկումը։ «Բարձրունքի վրա» ժողովածուն բանաստեղծական կորցրած աշխարհն կրկին գտնելու փորձ էր, որով գրում է մանկության և պատանեկության արծարծումներով մի շարք թրթռուն պատկերներ, որոնց թվում էր, օրինակ, «Հորթը».</p>
<br />
<div className='img2'></div>

<p style={{textAlign:"center"}}>	Մի հորթ է նստել թեք ձորալանջին,<br />
Թփերում կորած կածանի վրա,<br />

Կարծես քանդակված մի տերև լինի<br />

Մոր լեզվի հետքը ճակատին նրա…<br />

Մորթն է թրթռում, երբ ճոճվող թփի<br />

Տերևը հանկարծ քսվում է նրան,<br />

Եվ թրթռում է մորթի հետ նրբին՝<br />

Ծաղկած մասրենու ստվերը վրան…</p>
<div className='img3'></div>
<br />
<h5>Երկրորդ շրջան</h5>
<p>Ավարտվում է բանաստեղծի ստեղծագործության առաջին շրջանը և սկսվում նորը՝ «Մայրամուտից առաջ» (1964), «Քարափների երգը» (1968), «Տարիներս» (1970) ժողովածուներով, որոնք նոր սկիզբ տվեցին Սահյանի ստեղծագործության մեջ. նրա քնարերգությունը հարստանում է թարմ արտահայտչաձևերով, բանաստեղծության ավանդական կառույցները նորոգվում են պատկերային նոր մտածողությամբ, ամրանում է բանաստեղծի կապն իր հոգևոր արմատների հետ։ Այդ գրքերում նա հանդես է գալիս նաև որպես գեղագետ-փիլիսոփա։ «Քարափների երգը» ժողովածուում քարափները ներկայացված են որպես մարդկության աղբյուրներ։ Ժողովածուի մի բանաստեղծության մեջ բանաստեղծը դիմում է իր ծննդավայրին և ասում է. «Քո սարերին եմ թիկնելու նորից»։ Այդ նույն բանաստեղծության մեջ Սահյանը բերում է երդման խոսքը.</p><br/>
<div className='img2'></div>

<p style={{textAlign:"center"}}>…Եվ հոգնաշավիղ աշխարհների մեջ<br />
Ինչ կաչերով էլ ականջս շահեն,<br />

Ինչ սերերով էլ սիրտս պաշարեն,<br />

Ինչ համերով էլ կաշառեն լեզուս,<br />

Շաղոտ շուրթերով՝ շարականաշուք<br />

Քո շշուկներն են կրկնելու նորից…</p>
<div className='img3'></div>
<br />
</div>
</section>
</div>
</>
  )
}

export default Sahyan
