import React from "react"
import './Charents.css';

function Charents() {
    return (
      <>
    <h1 style={{color:'#3c3b3b',fontFamily:"cursive"}}>Եղիշե Չարենց</h1>
    <div className='container'>
      <section className='items'>
  
  
  <div className='item1'>
    <h2>Գրական անուն</h2>
    <hr />
    <p>Եղիշե Չարենցը Գուրգեն Մահարուն պատմել է, թե Կարս էր եկել Չարենց ազգանունով մի բժիշկ, որի ցուցատախտակի «Չարենց» մակագրությունն էլ վերցրել է։ Պատանեկան տարիների մտերիմները այլ բացատրություններ էլ են տալիս։ Ըստ Կարինե Քոթանջյանի՝ բանաստեղծը Չարենց է մկրտվել, որովհետև մանկուց եղել է չար երեխա։ Նրան այնքան են չար ասել, որ Չարենց էլ մնացել է։ Իսկ Անուշավան Ջիդեջյանը (Վիվան) բանաստեղծի կողմից վկայել է, որ Չարենց անունն առաջացել է Ալեքսանդր Պուշկինի «Անչար» ոտանավորի հնչյունական տեղաշարժերի արդյունքում, անչարը ծառատեսակ է, որ աճում է անապատում, և որի արմատները թույն են արտադրում։ 1921 թվականից «Չարենց» գրական անունը նրա համար դառնում է նաև քաղաքացիական ազգանուն։ «Չարենց» անվան ընտրությանը բանաստեղծն ավելի ուշ տվել է տրամաբանական այսպիսի բացատրություն. «Աշխարհում բարու դիմակի տակ շատ հաճախ չարն է թաքնված, ես էլ իմ հոգու բարի բովանդակությանը, այսպես ասած, չար անուն եմ տվել»։</p>
  <br />
  <h2>Կենսագրություն</h2>
  <hr />
  <p>Չարենցը ծնվել է 1897 թվականին, Կարսում։ «Արևելյան փոշոտ ու դեղին մի քաղաք, անկյանք փողոցներ, բերդ, Վարդանի կամուրջ, Առաքելոց եկեղեցի և հինգ հարկանի պաշտոնական մի շենք»,- այսպես է գրողը ներկայացնում իր ծննդավայրը։ Այս տխուր միջավայրը, սակայն, նրան տվել է ինչ-որ բան, ազդել մանուկ հոգու վրա։ Բանաստեղծն ինքն էլ այս մթնոլորտի հետ է կապում իր խառնվածքի ձևավորումը։ Նրա ծնողները՝ գորգավաճառ Աբգար Սողոմոնյանը և Թեկղի /Թելլի/ Միրզայանը, Կարս էին գաղթել Իրանի Մակու քաղաքից։ Սողոմոնյանների ընտանիքում մեծանում էին չորս տղա և երեք աղջիկ։ Կարսի տունը այժմ կիսավեր վիճակում է։ Ապագա բանաստեղծը հետևողական կրթություն չի ստացել։ 1908-1912 թվականներին սովորել է Կարսի ռեալական ուսումնարանում և հեռացվել՝ ուսման վարձը վճարել չկարողանալով պատճառով։ 1912 թվականին Թիֆլիսի «Պատանի» ալմանախում լույս է տեսել նրա «Ծաղիկները հեզ թեքվում են քամու օրորի տակին» տողով սկսվող առաջին բանաստեղծությունը։ 1914 թվականին լույս տեսավ նրա բանաստեղծությունների առաջին գիրքը՝ «Երեք երգ տխրադալուկ աղջկան». նա արդեն հանդես էր գալիս «Չարենց» գրական ազգանվամբ։ 1915 թվականին նա զինվորագրվում է հայ կամավորական գնդերից մեկում և հասնում մինչև Վան։


«Եղիշե Չարենց», նկարիչ՝ Վրույր Գալստյան, 1964
1915 թվականին Հայկական կամավորական 6-րդ ջոկատը, թուրքերի դեմ կռվող ռուսական բանակին միանալու համար, անցնում էր Վանա լճից հյուսիս-արևելք գտնվող Թափարիզ լեռան վրայով։ Լեռան կատարին՝ ձյուների մեջ, սառած-ընկած էին ծերերի, կանանց, երեխաների դիակներ... Տարերայնորեն գումարված միտինգում ելույթ ունեցավ նաև վտիտ մարմնով կարսեցի մի կամավորական։ Զինվորական համազգեստը մեծ էր նրա վրա, բայց խոշոր, սև աչքերում այնպիսի կրակներ էին վառվում, որ ոչ ոք չէր նկատում հագուստի անհամապատասխանությունը։ Այդ զինվոր-հռետորը ապագա մեծ բանաստեղծ Եղիշե Չարենցն էր (Սողոմոնյան)։ Տեսածի, ապրածի ու զգացածի յուրահատուկ արտահայտությունը հետագայում դարձավ բանաստեղծի «Դանթեական առասպել» պոեմը, որը 1914-1918 թվականների համաշխարհային պատերազմի առաջին և ամենացնցող արձագանքն է հայ գրականության մեջ։ Այս պոեմը առաջին գրավոր հիշատակություններից է Հայոց եղեռնի մասին[7]։

Գիտելիքների պակասը նա լրացրել է կյանքի համալսարաններում և ընթերցանությամբ։ Հայրենիքին պիտանի լինելու մղումով 1919 թվականի աշնանը նա ուսուցչություն է անում Կարսի մարզի Բաշքյադիկլար գյուղի դպրոցում։

Չարենցի անունը նրան արժանի բարձր գնահատականով ներկայացնելու պատիվը վիճակված էր խոշորագույն քննադատ, Հանրային կրթության և արվեստների նախարար Նիկոլ Աղբալյանին, որն էլ հայ գրական ընկերության անդրանիկ նիստերից մեկը 1919 թվականի հոկտեմբերի 18-ին նվիրեց Չարենցի ստեղծագործությանը։ Բանաստեղծը թեև ներկա չէր երեկոյին, բայց տեղեկացավ գրական այդ իրադարձության մասին։ 1920 թվականի հունվար-մայիս ամիսներին Աղբալյանին ներկայացած բանաստեղծն աշխատանքի է նշանակվել Աղբալյանի ղեկավարած նախարարությունում, որպես հատուկ հանձնարարությունների կոմիսար։ 1920-1921 թվականներին Չարենցին վերստին տեսնում ենք ուսուցչի պաշտոնում։ Այս բարդ ու հարափոփոխ ժամանակների ծնունդն են նրա «Նաիրի երկրից», «Դեպի ապագան», «Բրոնզե թևերը կարմիր գալիքի» ռադիոպոեմները՝ գրված 1920 թվականին։

1920 թվականի նոյեմբերին՝ Հայաստանի խորհրդայնացումից հետո, Լուսավորության ժողովրդական կոմիսարիատում նա ստանձնում է արվեստի բաժնի վարիչի պաշտոն և աշխատում մինչև 1921 թվականի մայիսը։ 1920-ական թվականների առաջին տարիները ևս բուռն շրջան են նրա թե՛ գրական, թե՛ անձնական կյանքում։ Մեկը մյուսի հետևից գրում է «Էմալե պրոֆիլը Ձեր», «Փողոցային պչրուհուն» շարքերը, «Ամենապոեմ», «Չարենցնամե» պոեմները, շարադրում «Երկիր Նաիրի» վեպը։ 1921 թվականի մայիսին ամուսնանում է Արփենիկ Տեր-Աստվածատրյանի հետ, ում հանդեպ տածում էր անսահման սեր ու գորով և ում հետագայում պիտի կոչեր «հերոսական կին և բարեկամ»։ Արփենիկի հետ էլ նա մեկնում է Մոսկվա՝ Արևելքի աշխատավորների համալսարանում լրացնելու կրթության պակասը։ Սակայն նրա անհանգիստ ոգին չէր կարող տեղավորվել ուսանողական նստարանին։ Կյանքը հոսում էր, գրական գործը՝ եռում։ 1922 թվականին Մոսկվայում նա լույս է ընծայում իր երկերի երկհատոր մեծադիր ժողովածուն, որ ինքնին երևույթ էր այդ տարիների հայ կյանքում։ 1922 թվականի «Երեքի» դեկլարացիայից հետո նա փաստորեն դառնում է նորագույն շրջանի հայ գրականության առաջնորդը։

Աշխարհաճանաչողությունն ընդարձակելու նպատակով, շնորհիվ գրականագետ Հարություն Սուրխաթյանի, 1924 թվականի նոյեմբերի 20-ին Բաթումից Չարենցը մեկնում է արտասահմանյան շրջագայության։ Լինում է Տրապիզոնում, Կ.Պոլսում, Աթենքում, Հռոմում, Վենետիկում, Փարիզում, Բեռլինում։ 1925 թվականի հուլիսի 31-ին վերադառնալով Երևան՝ նա ստանձնում է նոր կազմավորված «Հոկտեմբեր» գրական միության ղեկավարությունը՝ այն վերանվանելով «Նոյեմբեր»։ Բռնկուն և ազատ տարերքի ստեղծագործող էր Չարենցը։ Այդ տարերքը երկնում էր հանճարեղ գործեր։ Հոգեկան այդ լարված կացության մեջ սիրային մի արկած Չարենցի համար ունենում է տխուր վերջաբան։ 1926 թվականի սեպտեմբերի 5-ին նա ձերբակալվում և հայտնվում է Երևանի ուղղիչ տանը։ Աբովյան փողոցում հոգեկան անհավասարակշիռ կացության մեջ Չարենցը ատրճանակով կրակում և վիրավորում է Մարիաննա Այվազյան անունով մի գեղեցկուհու, որի հանդեպ նախապես ունեցել էր բուռն զգացմունքներ։ Բարեբախտաբար, Չարենցը վրիպում է և սոսկ թեթև քերծվածք պատճառում այդ աղջկան, որը կոմպոզիտոր Արտեմի Այվազյանի քույրն էր։ Այդ արկածից որպես հիշատակ մնում է «Երևանի ուղղիչ տնից» հուշ-ակնարկը։ 1927 թվականին մահանում է Չարենցի կինը։ Արփիկի մահը Չարենցը շատ ծանր է տարել։ Մահվան հաջորդ օրն իսկ այրել է հանգուցյալ կնոջ բոլոր զգեստները, որոնք սիրով ու գուրգուրանքով բերել էր արտասահմանից։ Այրել է, որպեսզի ուրիշի ձեռքը չընկնեն, և դրանով իսկ չնսեմանա սիրելիի հիշատակը։ Իսկ որպես թանկարժեք մասունք՝ իր խնդրանքով քանդակագործ Արա Սարգսյանը հանել է Արփիկի գիպսե դիմակը և ձեռքի կրկնօրինակը։ Դրանք պահվում են բանաստեղծի տուն-թանգարանում։ Այդ օրերին էլ Չարենցը նախաբազկին է դաջել Արփիկի մահվան տարեթիվն ու նրա անունը։ Արփիկի մահից հետո՝ մինչև հարազատների մոտ՝ Մայկոպ մեկնելը, Չարենցը մեկուսացել է շրջապատից, օրեր շարունակ փակվել իր սենյակում և գրել «De profundis» վերնագրով պոեմ, որ հոգեհանգստի աղոթքի տրամադրություններ է ունեցել։

1932 թվականին լրանում է Չարենցի գրական գործունեության 20 տարին։ Գրողների միությունը որոշում է նշել այդ հոբելյանը, ինչն այդպես էլ չի նշվում։ 1934-ին Չարենցը մասնակցում է ԽՍՀՄ գրողների առաջին համագումարին։ 1935 թվականից սկսած՝ Չարենցի դեմ ուղղված հալածանքներն ավելի են խորանում։ Նրան հեռացնում են հրատարակչությունից և գրողների միությունից։ 1936 թվականի սեպտեմբերի 24-ից Չարենցը ենթարկվում է տնային կալանքի, նույնը վերջնականապես պարտադրվում է նոյեմբերի 9-ին։ Հայտնի է նաև, որ այդ օրերին գրազի համար մի գիշերում Չարենցը գրել և հաջորդ օրը պատռել է վեց տասնյակից ավելի քառյակ։ 1936 թվականից ավելի ուժգնացած հալածանքների օրերին Չարենցը մեկուսացած կյանք է վարում։ Նա սպասումների մեջ էր։

1936 թվականի հունիսի 20-ին Անդրերկրկոմի ղեկավարության հետ Խանջյանը սկսում է բանակցություններ վարել, որպեսզի Չարենցին թույլատրեն մեկնել արտասահման՝ բուժման նպատակով։ Սակայն Խանջյանի դավադիր սպանությունը ձախողում է Չարենցի մեկնումը։ 1937 թվականի նոյեմբերի 27-ի առավոտյան՝ ժամը 7։00-ին, Կենտրոնական բանտի հիվանդանոցում, օրեր շարունակ տևած անգիտակից վիճակից հետո, բոլորից լքված ու անօգնական՝ իր մահկանացուն է կնքում Եղիշե Չարենցը՝ ժամանակի մեծագույն բանաստեղծը։ Մարտի 13-ին լրացել էր նրա 40 տարին։ Տարիներ շարունակ տևած այս դաժան ողբերգության գլխավոր դեմքը արյունաքամ և ուժասպառ հեռացավ աշխարհից։ Հաջորդ օրը՝ նոյեմբերի 28-ին, կատարեցին դիահերձում։ Արձանագրության մեջ ասված է. «Քննության է դրված տղամարդու դիակ, միջինից ցածր հասակով, խիստ նիհարած։ Ձախ նախաբազկի արտաքին մակերեսին եղել է դաջված. «1927 թվականի հունվար, Ա.Չ»։ Անջինջ գրերով բանաստեղծը մարմնի վրա արձանագրել է իր մեծ սիրո՝ Արփենիկ Չարենցի մահվան թվականը։

Չարենցը տառապել է խորացած մորֆինիզմով, որից և հյուծվել է օրգանիզմը, իսկ վերջին օրերին մորֆիի բացակայությունը հասցրել է աղեստամոքսային ուղու քայքայման։ Գլուխ են բարձրացրել նաև նախկին հիվանդությունները՝ շարունակական պլևրիտը, լյարդի էխինակոկը, երիկամի բորբոքումը։ Այդ ամենը հասցրել է թոքերի կատառային բորբոքման, որից էլ վրա է հասել մահը։ Նրա վիճակը ծանրացել էր նոյեմբերի 17-ից, այդ պատճառով տեղափոխվել էր բանտի հիվանդանոց, ուր և վախճանվել է նոյեմբերի 27-ին։ Գերեզմանի տեղը անհայտ է։ Նա, որ վաղուց արդեն լեգենդ էր դարձել իր ժողովրդի համար, շարունակեց այդպես էլ ապրել մինչև իր նոր հարությունը ու նաև դրանից հետո։ Մարգարեանալով մի քանի ամիս առաջ՝ 1936 թվականի դեկտեմբերի 15-ին, նա գրել էր.
</p>
  <p style={{ textAlign:"center"}}> 
  
Իմ մահվան օրը կիջնի լռություն, <br />
Ծանր կնստի քաղաքի վրա,<br />
Ինչպես ամպ մթին կամ հին տրտմություն,<br />
Կամ լուր աղետի՝ թերթերում գրած։
   </p>
  
  <h2 style={{margin:"25px 0 0 0"}}>Անձնական կյանք</h2>
  <hr></hr>
  
  <p>1920-1921 թվականներին Եղիշե Չարենցն ապրում էր իր կյանքի ամենաբուռն օրերը։ Այդ աննախադեպ եռուզեռը նրան պարտադրել էր ոչ միայն ազգային, քաղաքական և հանրային կյանքը, այլև անձնական ճակատագիրը։

Ես արդեն անցել եմ ճանապարհը
Երկրային բոլո՜ր հույզերի...

Արտաքուստ բարեկիրթ, անգամ սառը, բայց ներքուստ վարար ու կրքոտ սեր է նա տածել բանաստեղծուհի Արմենուհի Տիգրանյանի հանդեպ, որը նրանից մեծ էր տասը տարով։ Ա. Տիգրանյանին ձոնած գալանտ երգերը՝ «Էմալե պրոֆիլը Ձեր» խորագրով, տպագրվել են մամուլում 1921 թվականին և երկերի ժողովածուի առաջին հատորում՝ 1922 թվականին։ Չարենցի սերն ամենևին անպատասխան չի եղել։ Այդ մասին են վկայում 1964 թվականին տպագրված բանաստեղծությունների ձեռագիր թերթիկները, որոնք նախկինում պահվել են Ա. Տիգրանյանի մոտ։ Այդ թերթիկների հակառակ երեսին ոչ Չարենցի ձեռքով գրված է երկու բանաստեղծություն։ Ամենայն հավանականությամբ դրանց հեղինակը Արմենուհի Տիգրանյանն է։

Հայտնի է Չարենցի սերը բանաստեղծուհի Լեյլիի (Փառանձեմ Սահակյան Տեր-Մկրտչյան) հանդեպ, որը նրանից մեծ էր տասներեք տարով։ Նրան ևս Չարենցը նվիրեց բանաստեղծությունների առանձին մի շարք՝ «Փողոցային պչրուհուն», որը ևս տպագրվեց երկերի ժողովածուի առաջին հատորում 1922 թվականին։ Ի դեպ, այդ շարքը Չարենցը գրել է Լեյլիի ալբոմում, որը սկսվում է Արմենուհի Տիգրանյանի ձեռքով գրված «Նորը լավ է, քան թե հինը...» եռատուն բանաստեղծությամբ՝ թվագրված 1919, ապրիլի 13, Թիֆլիս։ Սա նշանակում է, որ Արմենուհին և Լեյլին մտերիմներ են եղել, որոնց ընդհանուր մտերմությունը վայելել է և Չարենցը։ Նշենք նաև, որ Արմենուհին կոմպոզիտոր Արմեն Տիգրանյանի քույրն է։

Աստղիկ Ղոնդախչյանը եղել է Չարենցի առաջին սերը, ում էլ նվիրել է «Երեք երգ տխրադալուկ աղջկան» ժողովածուն։ Աստղիկը եղել է երաժիշտ և սովորել է Կարսի, Թիֆլիսի երաժշտանոցներում։ Չարենցը շատ մտերիմ էր նաև Աստղիկի հորեղբոր տղաների հետ։

Կարինե Քոթանճյանի հետ մտերմությունը եղել է ոչ միայն անձնական, այլ նաև ստեղծագործական։ Նրան է նվիրել «Ծիածան» շարքը։ 1917 թվականի մարտին Չարենցը հեռանում է Մոսկվայից՝ կայարանում կարդալով Կարինեի համար գիշերը գրված բանաստեղծությունը՝ «Հեռացումի խոսքեր»։

Լյուսի Թառայանի նկատմամբ Չարենցը նույնպես անտարբեր չի եղել։ Նա եղել է դերասանուհի, ապրել է Բաքվում։ Չարենցը և Լյուսի Թառայանը հանդիպել են 1918 թվականին՝ շատ կարճ ժամանակ։ Չարենցն իր «Չարենցնամե» պոեմում գրել է. «Ես երբեք չեմ մոռանա, Թառայա՛ն»։ Նրա «Բրոնզե քույր իմ, բրոնզե հարս» բանաստեղծությունը նույնպես նվիրված էր Լյուսիին։ 1930-ական թվականներին՝ կնոջ մահից հետո, Չարենցը մտադրվում է ամուսնանալ։ Թեկնածուների մեջ էր նաև այն տարիների Երևանի գեղեցկատես կանանցից մեկը՝ Արաքսյա Մանուկյանը, որով հետագայում գերվել է նաև Ավետիք Իսահակյանը։ Այդ կինը 1930 թվականի սկզբին կորցրել էր ամուսնուն՝ Ստեփան Մանուկյանին, որի աճյունը հիմա հանգչում է Կոմիտասի անվան պանթեոնում՝ Հովհաննես Հովհաննիսյանի կողքին։

Ամբողջ կյանքի ընթացքում, սակայն, Չարենցը չի մոռանում իր առաջին կնոջը՝ Արփենիկ Տեր-Աստվածարյանին, որը ծնվել էր 1888 թվականին Նախիջևանում։ Նախնական կրթությունը ստացել է Թիֆլիսի Գայանյան ուսումնարանում, ապա ուսումը շարունակել է Մոսկվայի ուսուցչական համալսարանում։ 1920 թվականին գալիս է Երևան և աշխատանքի անցնում հատուկ խնդիրներ ունեցող երեխաների ամերիկյան որբանոցում։ Այստեղ էլ կայանում է Չարենցի հետ նրանց հանդիպումը, և մեկ տարի անց նրանք ամուսնանում են։

Արփենիկին Չարենցը սիրել է մեծ սիրով։ Բնավորությամբ նա եղել է մեղմ ու սրտակից ընկեր, տխուր պահերին երգել Չարենցի համար։ Եվ որ ամենակարևորն է՝ հասկացել բանաստեղծին, ներել նրա մոլորությունները, սիրային պատմությունները, կենցաղային և գրական վեճերը։ Արփիկը հոգեկան նեցուկ է եղել Չարենցին և սատար կանգնել նրան մշտապես։ Արփիկի մահը Չարենցը շատ ծանր է տարել։ Կնոջ հուղարկավորության ժամանակ ամբողջ ճանապարհին, որ ձգվել էր դեպի ներկայիս Կոմիտասի այգին, այսինքն՝ նախկին Մլեր կոչված գերեզմանոցը, կյանքից հուսահատ ու ցավից տառապագին Չարենցը գոռացել է ու ողբացել։ Գերեզմանափոսի մոտ կանգնած դիմադրել է, չի թողել, որ դագաղը գերեզմանափոս իջեցնեն, ստիպել է բացել կափարիչը։ Ոմանք պատմում են, որ Արփիկի դագաղում՝ ապակյա տարայի մեջ ամփոփված, Չարենցը բանաստեղծություններ է թաղել։ Այդ սերը հետագայում շատ է ներշնչել բանաստեղծին։ «Էպիքական լուսաբացը»՝ «Նվիրում եմ գիրքս հիշատակին կնոջս, ընկերոջս, հերոսական բարեկամիս՝ Արփենիկ Չարենցին» ընծայագրով ձոնել է նրան։ Գրքում Արփենիկի հիշատակին նվիրված է նաև երկու սոնետ՝ «Իմ բարեկա՛մ, իմ սե՛ր, հերոսական ընկեր», «Մենք ապրեցինք քեզ հետ մի վիթխարի դարում»։ Նրան է ձոնել նաև «Տաղարան» ժողովածուն։

1931 թվականի սեպտեմբերի 29-ին Չարենցը պաշտոնապես գրանցում է ամուսնությունը Իզաբելլա Կոդաբաշյանի հետ։ Իզաբելլան Չարենցին պարգևում է երկու դուստր՝ Արփենիկը և Անահիտը։ 1932 թվականին ծնվում է Արփենիկը, 1935 թվականին՝ Անահիտը։ Արփենիկին ասել է Բոժիկ՝ փոքրիկ աստվածուհի, իսկ Անահիտին՝ Ադոկ՝ ասորափռյուգիական մեռնող ու հարություն առնող Ադոնիս աստծո անունով։

Ստեղծագործություններ
1912 թվականին Թիֆլիսի «Պատանի» ալմանախում Եղիշե Սողոմոնյան ստորագրությամբ տպագրվում է «Ծաղիկները հեզ թեքվում են քամու օրորի տակին» տողով սկսվող բանաստեղծությունը, իսկ 1914 թվականին արդեն «Եղիշե Չարենց» ստորագրությամբ լույս է տեսնում 17-ամյա պատանու «Երեք երգ տխրադալուկ աղջկան» գրքույկը՝ նվիրված Աստղիկ Ղոնդախչյանին. այն ընդգրկում էր մեկը մյուսին շարունակող երեք բանաստեղծություն։ Հաջորդ տարի՝ 1915 թվականին, լույս է տեսնում «Կապուտաչյա հայրենիք» պոեմը։ 1916 թվականին Թիֆլիսում լույս է տեսնում «Դանթեական առասպել» պոեմը։ Այդ օրերին էլ մեկնում է Մոսկվա՝ ուսումը շարունակելու Շանյավսկու համալսարանում, և մնում է այնտեղ մինչև 1917 թվականի գարունը։ 1918-1920 թվականներին գրում է «Սոմա», «Ամբոխները խելագարված» պոեմները և «Ողջակիզվող կրակ» շարքը։ 1920-1921 թվականներին Չարենցը գրում է «Նաիրի երկրից», «Դեպի ապագան», «Բրոնզե թևերը կարմիր գալիքի» ռադիոպոեմները։ 1922-1924 թվականներին Չարենցի նոր որոնումների շրջանն է. ստեղծվում են «Պոեզոզուռնա», «Կոմալմանախ» ժողովածուները, «Ռոմանս անսեր» պոեմը, «Ասպետական» ռապսոդիան, «Կապկազ թամաշան»։ 1915 թվականին նա զինվորագրվում է Քանաքեռում կազմավորվող հայկական կամավորական խմբերին և որպես սանիտար, նաև որպես կռվող զինվոր՝ հասնում է մինչև Վան։ 1930-ականներին Չարենցին Հայաստանի գրողները խորհուրդ են տալիս մեկնել Հայաստանից դեպի Ռուսաստան, քանի որ կանխազգում էին, որ հնարավոր է՝ բանաստեղծը ստալինյան ռեպրեսիաների զոհը դառնա։ Խաչիկ Դաշտենցին Չարենցն ասել է, որ չի կարող մեկնել Հայաստանից, քանի որ իրեն Հայաստանից դուրս չի պատկերացնում։</p>
 
  </div>
  <div className="items2">
  <div className='item2'>
    <h2 style={{textAlign:"center",margin: "15px",color:"darkslategray",fontFamily:"cursive",fontSize:"30px",backgroundColor: "#a8d3ff", padding:"0 10px"}}>Եղիշե Չարենց</h2>
    <div className='item1_1'></div>
    <table  style={{width:"290px"}}>
    <tr >
      <th>Ծննդյան անուն</th>
      <td >Եղիշե Աբգարի Սողոմոնյան</td>
    </tr>
    <tr>
      <th>Ծնվել </th>
    <td> <a href="#">մարտի 13 (25), 1897 կամ մարտի 13, 1897</a></td>
    </tr>
    <tr>
      <th>Ծննդավայր</th>
      <td><a href='https://hy.wikipedia.org/wiki/%D4%BF%D5%A1%D6%80%D5%BD' target="_blank">Կարս, Կարսի մարզ,</a> <a href="https://hy.wikipedia.org/wiki/%D5%8C%D5%B8%D6%82%D5%BD%D5%A1%D5%AF%D5%A1%D5%B6_%D5%AF%D5%A1%D5%B5%D5%BD%D6%80%D5%B8%D6%82%D5%A9%D5%B5%D5%B8%D6%82%D5%B6" target="_blank">Ռուսական կայսրություն</a></td>
    </tr>
    <tr>
      <th>Վախճանվել է</th>
      <td><a href='#'>	նոյեմբերի 27, 1937 (40 տարեկան)</a></td>
    </tr>
    <tr>
      <th>Վախճանի վայր</th>
      <td><a href='https://hy.wikipedia.org/wiki/%D4%B5%D6%80%D6%87%D5%A1%D5%B6' target="_blank">Երևան, Հայկական ԽՍՀ, ԽՍՀՄ</a></td>
    </tr>
    <tr>
      <th>Գերեզման</th>
      <td><a href='#'>անհայտ</a></td>
    </tr>
    <tr>
      <th>Մասնագիտություն	</th>
      <td><a href='#'>թարգմանիչ, բանաստեղծ, արձակագիր և գրող</a></td>
    </tr>
    <tr>
      <th>Ազգություն</th>
      <td><a href='#'>հայ</a></td>
    </tr>
    <tr>
      <th>Քաղաքացիություն</th>
      <td><a href='#'>Ռուսական կայսրություն և ԽՍՀՄ</a></td>
    </tr>
    <tr>
      <th>Ժանրեր</th>
      <td><a href='#'>բանաստեղծություն և պոեմ</a></td>
    </tr>
    <tr>
      <th>Գրական շարժումներ	</th>
      <td><a href='#'>Ռեալիզմ, Ֆուտուրիզմ</a></td>
    </tr>
    <tr>
      <th>Կուսակցություն</th>
      <td><a href='https://hy.wikipedia.org/wiki/%D4%BD%D5%B8%D6%80%D5%B0%D6%80%D5%A4%D5%A1%D5%B5%D5%AB%D5%B6_%D5%84%D5%AB%D5%B8%D6%82%D5%A9%D5%B5%D5%A1%D5%B6_%D5%AF%D5%B8%D5%B4%D5%B8%D6%82%D5%B6%D5%AB%D5%BD%D5%BF%D5%A1%D5%AF%D5%A1%D5%B6_%D5%AF%D5%B8%D6%82%D5%BD%D5%A1%D5%AF%D6%81%D5%B8%D6%82%D5%A9%D5%B5%D5%B8%D6%82%D5%B6' target="_blank">PCUS</a></td>
    </tr>
    <tr>
      <th>Ամուսին</th>
      <td><a href='#'>Արփենիկ Չարենց, Իզաբելլա Չարենց</a></td>
    </tr>
    </table>
  </div>
  <div className="item3">
  <div className="item3-1"></div>
  <p>Եղիշե Չարենցի հայրը</p>
  </div>
  <div className="item4">
      <div className="item4-1"></div>
      <p>Չարենցի տունը Կարսում</p>
  </div>
  </div>
  </section>
  </div>
  </>
    )
  }
export default Charents